# 삼성 멀티캠퍼스 - 웹크롤링 기초
## API를 이용한 데이터 수집

In [30]:
from urllib.request import urlopen,Request
import urllib

### 접속에 필요한 상수값들 정의

.encode("utf-8") # 한글을 웹으로 전송시 인코딩 처리 -> .encode
근데 이건 POST 방식에서 먹히는 방식 하지만 여기선 GET

In [55]:
# KaKao Rest API 키
KAKAO_REST_API_KEY = 'd39b9e323a7a2aed04ea5d5bd3084ac9'

# POSTMAN에 필요했던 인자값들
URL_BASE = 'https://dapi.kakao.com/v2/search/web'
PARAMS = 'query=%s&page=1&size=50' % urllib.parse.quote('머신러닝') # 
HEADER = 'KakaoAK %s' % KAKAO_REST_API_KEY
PARAMS

'query=%EC%84%9C%EA%B0%80%EB%8C%80&page=1&size=50'

`naver.py`에서 코드 좀 빌려오자

In [56]:
# 헤더 설정
url = '%s?%s' % (URL_BASE,PARAMS)
request = Request(url)
request.add_header("Authorization",HEADER)

### HTTP 요청
- 응답의 결과는 json 결과로 온다
- http://json.parser.online.fr/ 를 통해서 json구조를 확인할 수 있다
    - 받아온 결과는 Dict -> List -> Dict

### 데이터 추출

이러한 과정을 **파싱(parsing)** 이라 한다. 그리고 이렇게 한 뒤에 `PyMySQL`로 DB로 넣는다.

그리고 이게 귀찮으면 나중에 `Pandas`를 통해서 데이터 통째로 넣을 수 있다.
```
pip install pymysql sqlalchemy pandas
```
`Anaconda Prompt`를 통해 위 명령어를 실행해서 패키지를 설치하자

In [69]:
import json
response = urlopen(request) # 리턴된 타입은 http.client.HTTPResponse
result = json.load(response)
result['documents'][0].keys()

dict_keys(['datetime', 'contents', 'title', 'url'])

In [72]:
# json으로 받아온 결과의 제목들만 출력해보자
for i in range(len(result['documents'])):
    pass # 넘 길어서 잠시 접어뒀음
    #print(i,'번째 제목 : ',result['documents'][i]['title'].replace('<b>','').replace('</b>','')) # <b></b> 제거 ... 정규식을 하기엔 아직 부족

In [74]:
import pymysql
from sqlalchemy import create_engine
import pandas as pd
import pandas.io.sql as pSql

In [88]:
# 연결
db_url = 'mysql+pymysql://root:12341234@127.0.0.1/python_db'
engine = create_engine(db_url,encoding='utf8')

In [106]:
# 실제 연결
conn = engine.connect()
# 데이터 획득
df = pSql.read_sql("select * from tbl_trade",conn)
df.head()

,code,name,cur,rate,updown,amount,sum,cur2,high,low,tAmount,ta_per,ta_cnt,for_cnt,for_per
0,005930,삼성전자,"2,861,000","107,000",3.9,"290,205","827,303,909,524","2,875,000","2,875,000","2,809,000","371,267,661,334,000",19.44,"129,768,494",,
1,000660,SK하이닉스,"85,300","3,100",3.8,"7,067,296","601,022,658,680","86,000","86,000","84,000","62,098,601,734,500",3.25,"728,002,365",,
2,005935,삼성전자우,"2,335,000","95,000",4.2,"58,951","137,238,577,152","2,336,000","2,359,000","2,301,000","43,007,384,300,000",2.25,"18,418,580",,
3,005380,현대차,"160,500",-500,-0.3,"601,287","96,579,433,000","159,000","162,000","158,500","35,354,374,879,500",1.85,"220,276,479",,
4,051910,LG화학,"414,500","11,000",2.7,"336,389","138,834,795,264","407,000","419,000","405,500","29,260,526,173,500",1.53,"70,592,343",,